freeshelf/app/controllers/application_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
---
  def current_user
    # if the session is not empty...
    if session[:user_id]
      # if I have the variable @user use that if not set it to this...
      @user ||= User.find(session[:user_id])