freeshelf/app/controllers/application_controller.rb

INSERT INTO "users" ("name", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["name", "ppreyer"], ["created_at", "2018-05-22 22:33:59.250205"], ["updated_at", "2018-05-22 22:33:59.250205"]]
SELECT  "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "ppreyer"], ["LIMIT", 1]]
---
  def current_user
    User.find_or_create_by(name: "ppreyer")