freeshelf/app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    if @book.save
---
INSERT INTO "books" ("title", "author", "description", "url", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "Rubyers"], ["author", "Parker Preyer"], ["description", "yes"], ["url", "www.google.com"], ["created_at", "2018-05-22 23:08:58.897895"], ["updated_at", "2018-05-22 23:08:58.897895"]]

  def update
    @book = Book.find(params[:id])

    if @book.update(book_params)
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "books" SET "title" = $1, "updated_at" = $2 WHERE "books"."id" = $3  [["title", "Ruby is for Gods"], ["updated_at", "2018-05-21 21:27:01.416041"], ["id", 1]]