freeshelf/app/controllers/checkouts_controller.rb

  def index
    @checkouts = Checkout.all
---
SELECT  "checkouts".* FROM "checkouts" ORDER BY "checkouts"."id" ASC LIMIT $1  [["LIMIT", 1]]

  def show
    @checkout = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]