freeshelf/app/controllers/checkouts_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def new
    @checkout = Checkout.new
    @book = Book.find(params[:book_id])

INSERT INTO "checkouts" ("user_id", "book_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["user_id", 5], ["book_id", 19], ["created_at", "2018-05-25 02:24:17.535844"], ["updated_at", "2018-05-25 02:24:17.535844"]]
---
  def create
    @checkout = Checkout.new(checkout_params)
    if @checkout.save

SELECT  "checkouts".* FROM "checkouts" WHERE "checkouts"."id" = $1 LIMIT $2  [["id", 15], ["LIMIT", 1]]
DELETE FROM "checkouts" WHERE "checkouts"."id" = $1  [["id", 15]]
---
  def destroy
    @checkout = Checkout.find(params[:id])
    @checkout.destroy