freeshelf/app/controllers/checkouts_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
  def show
    @checkout = Book.find(params[:id])